tap "homebrew/bundle"
tap "jesseduffield/lazygit"
tap "oven-sh/bun"
tap "teamookla/speedtest"
# Freely available high-quality data compressor
brew "bzip2"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Install RubyGems as Homebrew formulae
brew "brew-gem"
# Library for command-line editing
brew "readline"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GNOME XML library
brew "libxml2"
# GitHub command-line tool
brew "gh"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# C XSLT library for GNOME
brew "libxslt"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP load generator, inspired by rakyll/hey with tui animation
brew "oha"
# Manage compile and link flags for libraries
brew "pkg-config"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
